<?
cd path/to/dir      //      сменить директорию относительно
cd /path            //      путь относительно корня сайта
cd ../              //      на папку вверх 


ls                  //      список папок/файлов в линию
    -l              //      в столбец
    -a              //      с указанием системных файлов и папок

pwd                 //      вывод текущей папки
whoami              //      вывод текущего пользователя


chmod +x ./myscript //      сделать файл исполняемым
./myscript          //      запустить скрипт из текущего каталога



?>