<!DOCTYPE HTML>
<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
	<title>Сайт</title>
</head>

<body>

<style type="text/css">

	html{
		scroll-behavior: smooth;
	}
	body{
		margin: 0;
	}

	li{
		display: inline;
		border: 1px solid #999;
		cursor: pointer;
		border-radius: 3px;
		background-image: linear-gradient(0deg, #888, #eee);
		padding: 5px 10px;
		filter: drop-shadow(2px 2px 2px black);
		color: black;
	}
	a{
		text-decoration: none;
		color: inherit;
	}
	#gl1{
		background-color: #f77;
		width: 400px;
	}
	#gl2{
		background-color: #8f8;
		width: 400px;
	}
	#gl3{
		background-color: #88f;
		width: 400px;
	}
	#gl4{
		background-color: #ff8;
		width: 400px;
	}	
	#back{
		background-color: #888; 
		width: 100px;
		height: 30px;
		position: fixed;
		bottom: 20px;
		left: 420px;
		text-align: center;
		display: none;
	}		
</style>



<div id = "menu" style = "width: 400px; height: 50px;">
	<ul>
		<li id = "agl1"> 	<a href = "#gl1" > Глава 1 </a>	</li>
		<li id = "agl2">	<a href = "#gl2"> Глава 2 </a>	</li>
		<li id = "agl3">	<a href = "#gl3"> Глава 3 </a>	</li>
		<li id = "agl4">	<a href = "#gl4"> Глава 4 </a>	</li>
	</ul>

</div>

<div id = "back"  style = "cursor: pointer;" onclick = "window.scroll(0, 0);">	Назад	</div>

<div id = "gl1">
	Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы 
</div>	

<div id = "gl2">
		Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы 
</div>

<div id = "gl3">
		Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы 
</div>

<div id = "gl4">
		Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы Текст главы 
</div>

<script type="text/javascript">

	window.onscroll = function(){
		if(window.pageYOffset > 100){
			document.getElementById('menu').style.position = 'fixed';
			document.getElementById('back').style.display = 'block';
		}
		else{
			document.getElementById('menu').style.position = 'static';	
			document.getElementById('back').style.display = 'none';
		}

		var Ygl1 = gl1.getBoundingClientRect();
		var Ygl2 = gl2.getBoundingClientRect();
		var Ygl3 = gl3.getBoundingClientRect();
		var Ygl4 = gl4.getBoundingClientRect();

		if(Ygl1.bottom > 0){
			agl1.style.background-image = 'linear-gradient(0deg, #555, #aaa)';
		}
	}
	// ============ ВТОРОЙ ВАРИАНТ ПРОКРУТКИ НАВЕРХ ПРИ НАЖАТИИ НА КНОПКУ   ========================
	
	// back.onclick = function(){
	// 	window.scroll(0, 0);
	// }



</script>

</body>
</html>