<!DOCTYPE HTML>
<html>
<head>
	<meta http-equiv="Content-type" content="text/html; charset=utf-8" />
</head>
<body>

<?php   echo "это полный вариант тега php";   ?>

<?      echo "Это короткий вариант тега  php"  ?>

<script language = "php">

		echo "можно и так, но лучше использовать предыдущие методы"  

</script>


<?
$x = true;   // присаиваем переменной значение True

$x = 1645;    //   Целое число  integer

$x = 0121;    //   восьмеричное число       

$x = 0x1A;     // шестнадцатиричное число

$x = 12.35;     // вещественное число - foat     double

$X = 1.5e3;   //   =  1.5* 1000   

$a = "Какой нибудь текст"   //  

$b = 'Другой текст';    //

$c = array(13, 20, 4677);   //  массив из чисел    $c[0] = 13,    $c[1] = 20 ....

$d = array("name" => "ivan", "age" => "23", "country" => "Russia");    //ассоциативный сассив     $d['name'] = "ivan" ,  $d['age'] = 23 .....

//  Многомерный массив

$arr[0][0]="Овощи";
$arr[0][1]="Фрукты";
$arr[1][0]="Абрикос";
$arr[1][1]="Апельсин";
$arr[1][2]="Банан";
$arr[2][0]="Огурец";
$arr[2][1]="Помидор";
$arr[2][2]="Тыква";

4	5	8	5
3	5	0	8
5	3	8	4

$arr[0][0]= 4
$arr[0][1]= 5

$arr[1][0]=3
$arr[1][3]= 8
// Пример

$fruit[] = "Яблоко";
$fruit[] = "Банан";
$fruit[] = "Виноград";

// 1 вариант

$apple = $fruit[0];
$banan = $fruit[1];
$grapes = $fruit[2];

// 2 вариант

list($apple, $banan, $grapse) = $fruit;


?>
</body>
</html>